In [31]:
import numpy as np
import pandas as pd

In [32]:
df = pd.read_csv('professor_2.csv')

In [33]:
df.head(5)

,web-scraper-order,web-scraper-start-url,link,link-href,professor_name,avg_gpa,avg_rating
0,1596265352-9520,https://www.koofers.com/university-of-illinois...,"Darmody, Robert",https://www.koofers.com/university-of-illinois...,Robert Darmody,3.27,4.4286
1,1596265486-9566,https://www.koofers.com/university-of-illinois...,"Glosson, Pamela",https://www.koofers.com/university-of-illinois...,Pamela Glosson,NaN,5.0000
2,1596261192-8951,https://www.koofers.com/university-of-illinois...,"Slobodnik, Sydney",https://www.koofers.com/university-of-illinois...,Sydney Slobodnik,3.10,3.2500
3,1596242829-8120,https://www.koofers.com/university-of-illinois...,"Gan, Lu",https://www.koofers.com/university-of-illinois...,Lu Gan,NaN,3.0000
4,1596264667-9493,https://www.koofers.com/university-of-illinois...,"Miller, Michael",https://www.koofers.com/university-of-illinois...,Michael Miller,3.29,4.6667

In [34]:
df.shape

(1806, 7)

In [35]:
del df['web-scraper-order']
del df['web-scraper-start-url']
del df['link']
del df['link-href']
del df['avg_gpa']

In [36]:
df.head(5)

     professor_name  avg_rating
0    Robert Darmody      4.4286
1    Pamela Glosson      5.0000
2  Sydney Slobodnik      3.2500
3            Lu Gan      3.0000
4    Michael Miller      4.6667

In [37]:
df.isnull().sum()

professor_name    0
avg_rating        0
dtype: int64

In [38]:
df.professor_name.str.split(expand=True,)

            0            1     2     3
0      Robert      Darmody  None  None
1      Pamela      Glosson  None  None
2      Sydney    Slobodnik  None  None
3          Lu          Gan  None  None
4     Michael       Miller  None  None
...       ...          ...   ...   ...
1801    Scott  Willenbrock  None  None
1802  Donghun          Joo  None  None
1803    Naira   Hovakimyan  None  None
1804   Martin        Burke  None  None
1805  William     Bernhard  None  None

[1806 rows x 4 columns]

In [39]:
df['first_name'] = df.professor_name.str.split(" ",expand=True,)[0]
df['last_name'] = df.professor_name.str.split(" ",expand=True,)[1]

In [40]:
df.head(5)

     professor_name  avg_rating first_name  last_name
0    Robert Darmody      4.4286     Robert    Darmody
1    Pamela Glosson      5.0000     Pamela    Glosson
2  Sydney Slobodnik      3.2500     Sydney  Slobodnik
3            Lu Gan      3.0000         Lu        Gan
4    Michael Miller      4.6667    Michael     Miller

In [41]:
del df['professor_name']

In [42]:
df = df[['first_name', 'last_name', 'avg_rating']]

In [43]:
df.head(5)

  first_name  last_name  avg_rating
0     Robert    Darmody      4.4286
1     Pamela    Glosson      5.0000
2     Sydney  Slobodnik      3.2500
3         Lu        Gan      3.0000
4    Michael     Miller      4.6667

In [44]:
df.shape

(1806, 3)

In [45]:
df.to_csv('professor', encoding='utf-8', index=False)